// =============================================================
// Дмитрий Сошников: Функциональное программирования на языке F#
//                               http://www.soshnikov.com/fsharp
// -------------------------------------------------------------
// Глава 2: Рекурсивные структуры данных - Функц.структуры данных
// =============================================================

// "Наивная" реализация очереди
type 'a queue = 'a list;;

let tail = List.tail
let head = List.head
let rec put x L = L @ [x]

// Реализация очереди по Крису Окасаки
type 'a queue = 
      'a list * 'a list;;

let tail (L,R) = 
  match L with
   [x] -> (List.rev R, [])
  | h::t -> (t,R);;

let head (h::_,_) = h;;

let put x (L,R) =
  match L with
   [] -> ([x],R)
  | _ -> (L,x::R)
